app/views/users/index.html.erb

    <h1 class="user-title"><%= link_to user.title, user %></h1>
    <p class="user-content"><%= user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE (username like '%colin%')  ORDER BY created_at DESC