app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username like '%colin%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @users = User.search(params[:search]).order("created_at DESC")